#!/usr/bin/env python3
# -*- coding: utf-8 -*-

import numpy as np

#1.采用不同初始概率分布，最终状态的概率分布趋于同一个稳定的概率分布[0.625   0.3125  0.0625]，
#也就是说马尔科夫链模型的状态转移矩阵收敛到的稳定概率分布与初始状态概率分布无关
#2.这个性质不光对的状态转移矩阵有效，对于绝大多数的其他的马尔科夫链模型的状态转移矩阵也有效。
# 同时不光是离散状态，连续状态时也成立。
#3.对于一个确定的状态转移矩阵P，它的n次幂在当n大于一定的值的时候也可以发现是确定的。
#4.非周期的马尔科夫链：主要是指马尔科夫链的状态转化不是循环的，如果是循环的则永远不会收敛。
#5.任何两个状态是连通的：这个指的是从任意一个状态可以通过有限步到达其他的任意一个状态，
#不会出现条件概率一直为0导致不可达的情况。
#6.马尔科夫链的状态数可以是有限的，也可以是无限的。因此可以用于连续概率分布和离散概率分布。
#7.π通常称为马尔科夫链的平稳分布。

matrix = np.matrix([[0.9,0.075,0.025],[0.15,0.8,0.05],[0.25,0.25,0.5]], dtype=float)
vector1 = np.matrix([[0.7,0.1,0.2]], dtype=float)
for i in range(100):
    vector1 = vector1*matrix
    print("Current round:" , i+1)
    print(vector1)

    matrix = matrix*matrix
    print("Current round:", i + 1)
    print(matrix)